---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveByPointsProjectionType
source: html/25ef0a30-c088-6d07-5d27-c832fc541f26.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveByPointsProjectionType Property

"Projection Type"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveByPointsProjectionType { get; }
```